In [200]:
import pandas as pd
import matplotlib.pyplot as plt

In [201]:
student_data = {
    "Class": ["A", "A", "B", "B", "A", "C", "C", "C", "A"],
    "Name": ["Prosperity", "Annie", "Martha", "Lisa", "Bimbo", "Jessica", "Mary-Ann", "James", "Kelvin"],
    "English_Language": [None,56, 80, 90, 44, 77, 33, 20, 89],
    "Mathematics": [23, 44, 73, 11, 76, 39, 22, 79, 40],
    "Basic_Science": [67, 88, 39, 54, 66, 39, 88, 80, None]
}

In [202]:
df = pd.DataFrame(student_data)
df

  Class        Name  English_Language  Mathematics  Basic_Science
0     A  Prosperity               NaN           23           67.0
1     A       Annie              56.0           44           88.0
2     B      Martha              80.0           73           39.0
3     B        Lisa              90.0           11           54.0
4     A       Bimbo              44.0           76           66.0
5     C     Jessica              77.0           39           39.0
6     C    Mary-Ann              33.0           22           88.0
7     C       James              20.0           79           80.0
8     A      Kelvin              89.0           40            NaN

In [203]:
#for small number of columns
df["English_Language"] = df["English_Language"].fillna(df["English_Language"].mean())
df

  Class        Name  English_Language  Mathematics  Basic_Science
0     A  Prosperity            61.125           23           67.0
1     A       Annie            56.000           44           88.0
2     B      Martha            80.000           73           39.0
3     B        Lisa            90.000           11           54.0
4     A       Bimbo            44.000           76           66.0
5     C     Jessica            77.000           39           39.0
6     C    Mary-Ann            33.000           22           88.0
7     C       James            20.000           79           80.0
8     A      Kelvin            89.000           40            NaN

In [204]:
numeric_cols = df.select_dtypes(include="number").columns
df[numeric_cols]=df[numeric_cols].fillna(df[numeric_cols].mean())
df[numeric_cols] = df[numeric_cols].round(0)
df

  Class        Name  English_Language  Mathematics  Basic_Science
0     A  Prosperity              61.0           23           67.0
1     A       Annie              56.0           44           88.0
2     B      Martha              80.0           73           39.0
3     B        Lisa              90.0           11           54.0
4     A       Bimbo              44.0           76           66.0
5     C     Jessica              77.0           39           39.0
6     C    Mary-Ann              33.0           22           88.0
7     C       James              20.0           79           80.0
8     A      Kelvin              89.0           40           65.0

In [205]:
df.head(2)

  Class        Name  English_Language  Mathematics  Basic_Science
0     A  Prosperity              61.0           23           67.0
1     A       Annie              56.0           44           88.0

In [206]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Class             9 non-null      object
 1   Name              9 non-null      object
 2   English_Language  9 non-null      float64
 3   Mathematics       9 non-null      int64
 4   Basic_Science     9 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 488.0+ bytes

In [207]:
df.describe()

       English_Language  Mathematics  Basic_Science
count          9.000000     9.000000       9.000000
mean          61.111111    45.222222      65.111111
std           25.052168    25.326754      18.577166
min           20.000000    11.000000      39.000000
25%           44.000000    23.000000      54.000000
50%           61.000000    40.000000      66.000000
75%           80.000000    73.000000      80.000000
max           90.000000    79.000000      88.000000

#### Checking if there are empty cells

In [208]:
df.isna().sum()

Class               0
Name                0
English_Language    0
Mathematics         0
Basic_Science       0
dtype: int64

### This analysis explores student scores to determine average performance, rankings, pass rates, and subject difficulty.

In [209]:
df["Average"]= df[["English_Language", "Mathematics", "Basic_Science"]].mean(axis = 1).round(2)
df

  Class        Name  English_Language  Mathematics  Basic_Science  Average
0     A  Prosperity              61.0           23           67.0    50.33
1     A       Annie              56.0           44           88.0    62.67
2     B      Martha              80.0           73           39.0    64.00
3     B        Lisa              90.0           11           54.0    51.67
4     A       Bimbo              44.0           76           66.0    62.00
5     C     Jessica              77.0           39           39.0    51.67
6     C    Mary-Ann              33.0           22           88.0    47.67
7     C       James              20.0           79           80.0    59.67
8     A      Kelvin              89.0           40           65.0    64.67

#### Student names and average scores only

In [210]:
df[["Name", "Average"]]

         Name  Average
0  Prosperity    50.33
1       Annie    62.67
2      Martha    64.00
3        Lisa    51.67
4       Bimbo    62.00
5     Jessica    51.67
6    Mary-Ann    47.67
7       James    59.67
8      Kelvin    64.67

#### Top Students by Average

In [212]:
# df_top_students = df[df["Average"]> 60][["Name", "Average"]]
# df_top_students = df_top_students.sort_values(by="Average", ascending = False)
# df_top_students
sorted_average = df[df["Average"] > 60][["Name", "Average"]].sort_values(by="Average", ascending =False)
sorted_average

     Name  Average
8  Kelvin    64.67
2  Martha    64.00
1   Annie    62.67
4   Bimbo    62.00

In [213]:
df.sort_values(by= "Average", ascending=True, inplace = True)
df

  Class        Name  English_Language  Mathematics  Basic_Science  Average
6     C    Mary-Ann              33.0           22           88.0    47.67
0     A  Prosperity              61.0           23           67.0    50.33
5     C     Jessica              77.0           39           39.0    51.67
3     B        Lisa              90.0           11           54.0    51.67
7     C       James              20.0           79           80.0    59.67
4     A       Bimbo              44.0           76           66.0    62.00
1     A       Annie              56.0           44           88.0    62.67
2     B      Martha              80.0           73           39.0    64.00
8     A      Kelvin              89.0           40           65.0    64.67

#### Top Students by Average per class

In [218]:
class_group = df.loc[df.groupby("Class")["Average"].idxmax()]
class_group

  Class    Name  English_Language  Mathematics  Basic_Science  Average
8     A  Kelvin              89.0           40           65.0    64.67
2     B  Martha              80.0           73           39.0    64.00
7     C   James              20.0           79           80.0    59.67

In [ ]:
agg_df =df.groupby("Class")[["Mathematics", "English_Language", "Basic_Science"]].agg(["mean","count"])